/* 6. На складі є певна кількість ящиків з яблуками (у прикладі 15). Коли
під'їжджає машина для завантаження, попросити користувача ввести скільки
ящиків завантажити в першу машину, в другу і так далі, поки не закінчаться
ящики з яблуками. Передбачити той випадок, коли користувач введе
кількість ящиків більше, ніж на складі. */

let n = parseInt(prompt("Cтартова кільість ящиків з яблуками на складі: "));
let a = 0;
while (n != 0) {
    alert(`кільість ящиків з яблуками: ${n}`);
    let minus_box = parseInt(prompt("Кільість ящиків з яблуками, які завантажувати в машину: "));
    if (minus_box > n) {
        alert("Неможливо завантажити стільки ящиків ");
        continue; 
    }
    else {
        n -= minus_box;
        a +=1
    }

}
alert(`Кількість завантажених автомобілів: ${a}`);