/*9. Комерсант, маючи стартовий капітал n гривень, зайнявся торгівлею, яка
збільшує капітал на р% щомісяця. Через скільки років він накопичить суму s,
достатню для покупки власного магазину? */

let n = parseInt(prompt("Cтартовий капітал: "));
let p = parseInt(prompt("на скільки відсотків збільшується капітал щомісяця: "));
let s = parseInt(prompt("скільки коштує вдкрити магазин: "));
let year = 0;
let m = 0;

if (p <= 0) {
    alert("Сальдо від торгівлі від'ємне або дорівнює 0");
}
else {

        while (s >= n) {
            n = (n*((100 + p)/100));
            m +=1;
            if (m == 12) {
                year +=1;
                m = 0;
            }
        }
    alert(`Магазин можна купити через ${year} років і ${m} місяців`)
}
