/* Задача 19. Створити функцію, яка за назвою дня тижня повертає список пар на цей день. (Анонімна функція)*/

(function(){
    while (true) {
        let day = prompt("Введіть день тижня, щоб побачити список пар на цей день: ");
        if (day == "понеділок" || day == "Понеділок" || day == "1") {
            alert(`список пар на понеділок: \n 1. Дискретна математика \n 2. Програмування \n 3. Мат. аналіз/Веб-програмування `)
            break;
        }
        else if (day == "вівторок" || day == "Вівторок" || day == "2") {
            alert(`список пар на вівторок: \n 1. Програмування \n 2. Дискретна математика \n 3. Веб-програмування `)
            break;
        }
        else if (day == "середа" || day == "Середа" || day == "3") {
            alert(`список пар на середу: \n 1. Мат. аналіз/Програмування \n 2. Мат. аналіз \n 3. Історія України `)
            break;
        } 
        else if (day == "четвер" || day == "Четвер" || day == "4") {
            alert(`список пар на четвер: \n 1. Алгебра та Геометрія \n 2. Історія України \n 3. Алгебра та Геометрія `)
            break;
        }
        else if (day == "п'ятниця" || day == "П'яниця" || day == "5") {
            alert(`список пар на п'ятницю: \n 1. Мат. аналіз \n 2. Українська мова \n 3. Веб-програмування `)
            break;
        }
        else if (day == "субота" || day == "Субота" || day == "6" || day == "неділя" || day == "Неділя" || day == "7") {
            alert(`це вихідний день.`)
            break;
        }
        else {
            alert(`некоректна інформація. Введіть ще раз.`)
            continue;

        }

    }
})();
